app/controllers/csvimporters_controller.rb

SELECT  "csvimporters".* FROM "csvimporters" ORDER BY pri asc LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "csvimporters"
---
    def index
      @csvimporters = Csvimporter.search(csvimporter_params[:search])
                         .order(sort_column + " " + sort_direction)
                         .paginate(:per_page => 30, :page => csvimporter_params[:page])

DELETE FROM "csvimporters" WHERE "csvimporters"."id" = $1  [["id", 77]]
---
    def show
      if(params["commit"]=='Upload Data')
        print "\n\n\n\n\n\n\n>>>>>>>>>>>>>STRT Upload"
        #Csvimporter.all.each do |csvimprtr|
        #  mapping = Mapping.find_or_create_by(mapping_str:csvimprtr.mapping)
        #  mapping.save

        #  role = Role.find_or_create_by(role_str:csvimprtr.role)
        #  role.save

        #  question = Question.new(mapping_id: mapping.id, role_id:role.id, appearsDay: csvimprtr.appears, pri: csvimprtr.pri,
        #      quiz: csvimprtr.question, teamingStages: csvimprtr.teaming, frequency: csvimprtr.frequency,
        #      qType: csvimprtr.qtype, required: csvimprtr.required, conditions: csvimprtr.conditions);
        #  question.save
        #  csvimprtr.destroy
        #end

        redirect_to root_url, notice: "Data Has been Move to Main table, See on React Client"
      end

      if(params["commit"]=='Clean Data')
        print "\n\n\n\n\n\n\n>>>>>>>>>>>>>STRT DELETEEEEEEE"
        Csvimporter.destroy_all